readne actualizado
